      * SYMBOLIC MAP of samm00 Created by CACXBMS Version 6.0.27
       01  SAMM00I.
	   02  FILLER				      PIC X(12).
	   02  M00DATEL 			      PIC S9(4) COMP.
	   02  M00DATEF 			      PIC X.
	   02  FILLER REDEFINES M00DATEF.
	       03  M00DATEA			      PIC X.
	   02  FILLER				      PIC XXXX.
	   02  M00DATEI 			      PIC X(010).
       01  SAMM00O REDEFINES SAMM00I.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  M00DATEC 			      PIC X.
	   02  M00DATEP 			      PIC X.
	   02  M00DATEH 			      PIC X.
	   02  M00DATEV 			      PIC X.
	   02  M00DATEO 			      PIC X(010).
