*
* Header File for CA-Realia Accept routines
*
* This software is the property of
* Computer Associates International, Inc.
* and is protected by International Copyright law.
* Any unauthorized use or reproduction is prohibited.
*
* Copyright (c) 1992, 1996 Computer Associates International, Inc.
* All rights reserved.
*
*
* This COPY book defines the ACCEPT-CONSOLE data
* structures.  It may be copied into either the WORKING-STORAGE
* section or the LINKAGE section.
/
*  Revision History
*  ================
*
*  6.001  10 Mar 1997, 14:00 (DAS)
*     Change size of RETURN-CODE from 9 to 4.
*
 01  ACCEPT-CONSOLE-BLOCK.
     05  ACCEPT-CONSOLE-STATUS		    PIC X.
	 88   ACCEPT-CONSOLE-KEY-AVAIL		 VALUE X'01'.
	 88   ACCEPT-CONSOLE-NO-INPUT-AVAIL	 VALUE 0.
*	 Following value is reserved for future use.
	 88   ACCEPT-CONSOLE-STATUS-RESERVED	 VALUE X'02'.
     05  ACCEPT-CONSOLE-ASCII-CHAR	    PIC X.
     05  ACCEPT-CONSOLE-CONTROL-KEY	    PIC 9(4) BINARY.
	 88   ACCEPT-CONSOLE-KEY-CTRL-BREAK	 VALUE 3.
	 88   ACCEPT-CONSOLE-KEY-CLEAR		 VALUE 12.
	 88   ACCEPT-CONSOLE-KEY-CAPS-LOCK	 VALUE 20.
	 88   ACCEPT-CONSOLE-KEY-PAGE-UP	 VALUE 33.
	 88   ACCEPT-CONSOLE-KEY-PAGE-DOWN	 VALUE 34.
	 88   ACCEPT-CONSOLE-KEY-END		 VALUE 35.
	 88   ACCEPT-CONSOLE-KEY-HOME		 VALUE 36.
	 88   ACCEPT-CONSOLE-KEY-LEFT-ARROW	 VALUE 37.
	 88   ACCEPT-CONSOLE-KEY-UP-ARROW	 VALUE 38.
	 88   ACCEPT-CONSOLE-KEY-RIGHT-ARROW	 VALUE 39.
	 88   ACCEPT-CONSOLE-KEY-DOWN-ARROW	 VALUE 40.
	 88   ACCEPT-CONSOLE-KEY-INS		 VALUE 45.
	 88   ACCEPT-CONSOLE-KEY-DEL		 VALUE 46.
	 88   ACCEPT-CONSOLE-KEY-LEFT-WIN	 VALUE 91.
	 88   ACCEPT-CONSOLE-KEY-RIGHT-WIN	 VALUE 92.
	 88   ACCEPT-CONSOLE-KEY-WIN-APP	 VALUE 93.
	 88   ACCEPT-CONSOLE-KEY-F1		 VALUE 112.
	 88   ACCEPT-CONSOLE-KEY-F2		 VALUE 113.
	 88   ACCEPT-CONSOLE-KEY-F3		 VALUE 114.
	 88   ACCEPT-CONSOLE-KEY-F4		 VALUE 115.
	 88   ACCEPT-CONSOLE-KEY-F5		 VALUE 116.
	 88   ACCEPT-CONSOLE-KEY-F6		 VALUE 117.
	 88   ACCEPT-CONSOLE-KEY-F7		 VALUE 118.
	 88   ACCEPT-CONSOLE-KEY-F8		 VALUE 119.
	 88   ACCEPT-CONSOLE-KEY-F9		 VALUE 120.
	 88   ACCEPT-CONSOLE-KEY-F10		 VALUE 121.
	 88   ACCEPT-CONSOLE-KEY-F11		 VALUE 122.
	 88   ACCEPT-CONSOLE-KEY-F12		 VALUE 123.
	 88   ACCEPT-CONSOLE-KEY-NUMLOCK	 VALUE 144.
	 88   ACCEPT-CONSOLE-KEY-SCROLLOCK	 VALUE 145.
     05  ACCEPT-CONSOLE-CTLKEY-STATE.
	 10   ACCEPT-RIGHT-ALT-KEY	    PIC X.
	      88   ACCEPT-RIGHT-ALT-PRESSED	      VALUE X'01'.
	      88   ACCEPT-RIGHT-ALT-NOT-PRESSED       VALUE 0.
	 10   ACCEPT-LEFT-ALT-KEY	    PIC X.
	      88   ACCEPT-LEFT-ALT-PRESSED	      VALUE X'01'.
	      88   ACCEPT-LEFT-ALT-NOT-PRESSED	      VALUE 0.
	 10   ACCEPT-RIGHT-CTRL-KEY	    PIC X.
	      88   ACCEPT-RIGHT-CTRL-PRESSED	      VALUE X'01'.
	      88   ACCEPT-RIGHT-CTRL-NOT-PRESSED      VALUE 0.
	 10   ACCEPT-LEFT-CTRL-KEY	    PIC X.
	      88   ACCEPT-LEFT-CTRL-PRESSED	      VALUE X'01'.
	      88   ACCEPT-LEFT-CTRL-NOT-PRESSED       VALUE 0.
	 10   ACCEPT-SHIFT-KEY		    PIC X.
	      88   ACCEPT-SHIFT-PRESSED 	      VALUE X'01'.
	      88   ACCEPT-SHIFT-NOT-PRESSED	      VALUE 0.
	 10   ACCEPT-NUMLOCK-STATE	    PIC X.
	      88   ACCEPT-NUMLOCK-ON		      VALUE X'01'.
	      88   ACCEPT-NUMLOCK-OFF		      VALUE 0.
	 10   ACCEPT-SCROLLOCK-STATE	    PIC X.
	      88   ACCEPT-SCROLLLOCK-ON 	      VALUE X'01'.
	      88   ACCEPT-SCROLLLOCK-OFF	      VALUE 0.
	 10   ACCEPT-CAPSLOCK-STATE	    PIC X.
	      88   ACCEPT-CAPSLOCK-ON		      VALUE X'01'.
	      88   ACCEPT-CAPSLOCK-OFF		      VALUE 0.
	 10   ACCEPT-ENHANCED-KEYBD-KEY     PIC X.
	      88   ACCEPT-ENHANCED-KEY		      VALUE X'01'.
	      88   ACCEPT-NOT-ENHANCED-KEY	      VALUE 0.
	 10   ACCEPT-CONSOLE-KEYPAD-FLAG    PIC X.
	      88   ACCEPT-CONSOLE-NUMERIC-KEYPAD      VALUE X'01'.
	      88   ACCEPT-CONSOLE-NOT-KEYPAD	      VALUE X'00'.
*
 01  ACCEPT-CONSOLE-MILLISECONDS	    PIC S9(9) BINARY.
     88  ACCEPT-CONSOLE-NO-WAIT 		      VALUE 0.
     88  ACCEPT-CONSOLE-WAIT-INFINITE		      VALUE -1.
*
 01  ACCEPT-CONSOLE-RC			    PIC S9(4) BINARY.
     88  ACCEPT-CONSOLE-RC-OK			      VALUE 0.
*
 01  ACCEPT-PARAMETERS.
     05  ACCEPT-AUTO-ENTER		   PIC X.
	 88  SET-AUTO-ENTER		   VALUE 'Y'.
	 88  CLEAR-AUTO-ENTER		   VALUE 'N'.
     05  ACCEPT-TEST-EMPTY		   PIC X.
	 88  SET-TEST-EMPTY		   VALUE 'Y'.
	 88  CLEAR-TEST-EMPTY		   VALUE 'N'.
     05  ACCEPT-FILL-REQUIRED		   PIC X.
	 88  SET-FILL-REQUIRED		   VALUE 'Y'.
	 88  CLEAR-FILL-REQUIRED	   VALUE 'N'.
     05  ACCEPT-CURSOR-TERMINATORS	   PIC X.
	 88  SET-CURSOR-TERMINATORS	   VALUE 'Y'.
	 88  CLEAR-CURSOR-TERMINATORS	   VALUE 'N'.
     05  ACCEPT-ENTRY-REQUIRED		   PIC X.
	 88  SET-ENTRY-REQUIRED 	   VALUE 'Y'.
	 88  CLEAR-ENTRY-REQUIRED	   VALUE 'N'.
     05  ACCEPT-NO-ENTER-ECHO		   PIC X.
	 88  SET-NO-ENTER-ECHO		   VALUE 'Y'.
	 88  CLEAR-NO-ENTER-ECHO	   VALUE 'N'.
     05  ACCEPT-MODE			   PIC X.
	 88  ACCEPT-IN-BIOS-MODE	   VALUE 'Y'.
	 88  ACCEPT-IN-DOS-MODE 	   VALUE 'N'.
     05  ACCEPT-SCREEN-MSG-OFF		   PIC X.
	 88  SET-SCREEN-MSG-OFF 	   VALUE 'N'.
	 88  SET-SCREEN-MSG-ON		   VALUE 'Y'.
     05  FILLER 			   PIC X(6).
*
 01  ACCEPT-RC				    PIC S9(4) BINARY.
     88  ACCEPT-RC-OK				      VALUE 0.
