*$PP-DEF HEADER NI EXTERNAL PROGRAM
*$PP-NOLIST HEADER NI
*$PP-RELATIVE-LINE-ADJ +000000003
*
* This software is the property of Computer Associates International, Inc.
* and is protected by International Copyright law
* Any unauthorized use or reproduction is prohibited
*
* Copyright (c) 1995. 1996 Computer Associates International, Inc.
* All rights reserved
*
*    Description: CA-Realia COBOL 6.0 Realia Service Routines
*     NOTE:!! If any Max Size files contains a non-positive value
*	      then the default length is assumed to be 120
*
*^{Mods:*** }
***
*** Wed Sep 27 11:40:08 1995, Rev 1.0, GODCH01(0100)
*
 IDENTIFICATION DIVISION.
 PROGRAM-ID.	 REALIA EXTERNAL.
 DATA DIVISION.
 LINKAGE SECTION.

 01  SYSERRCODE 			   PIC S9(9) BINARY.
     88  NO-SYSERROR			   VALUE 0.

 01  PROCESSHANDLE			   PIC S9(9) BINARY.
 01  EXITCODEPROCESS			   PIC S9(9) BINARY.
 01  PROGRAMNAME			   PIC X.
 01  COMMANDLINE			   PIC X.
 01  PARMCOUNT				   PIC S9(9) BINARY.
 01  PARMLINE				   PIC X.
 01  PARMSIZE				   PIC S9(9) BINARY.
 01  PARMMAXSIZE			   PIC S9(9) BINARY.
 01  COMMANDNAME			   PIC X.
 01  COMMANDSIZE			   PIC S9(9) BINARY.
 01  COMMANDMAXSIZE			   PIC S9(9) BINARY.
 01  FILEDIRECTORY			   PIC X.
 01  FILENAME				   PIC X.
 01  FILEMAXNAMESIZE			   PIC S9(9) BINARY.
 01  FILENAMESIZE			   PIC S9(9) BINARY.

 01  OSMODE				   PIC 9(9) BINARY.
*    88  OS2-16BIT-PROTECTED-MODE	   VALUE 1. *> OBSOLETE
*    88  DOS-REAL-MODE			   VALUE 2. *> OBSOLETE
*    88  DOS-DOS16M-PROTECTED-MODE	   VALUE 3. *> OBSOLETE
*    88  WINDOWS-16BIT-STANDARD-MODE	   VALUE 4. *> OBSOLETE
*    88  WINDOWS-16BIT-PROTECTED-MODE	   VALUE 5. *> OBSOLETE
*    88  WINDOWS-32S-MODE		   VALUE 10. *> not available
     88  WINDOWS-NT-MODE		   VALUE 11.
     88  WINDOWS-95-MODE		   VALUE 12.
     88  OS2-32BIT-PROTECTED-MODE	   VALUE 20.
 01  MACHINENAMEMAXSIZE 		   PIC S9(9) BINARY.
 01  MACHINENAME			   PIC X.
 01  MACHINENAMESIZE			   PIC S9(9) BINARY.
 01  ENVNAME				   PIC X.
 01  ENVSTRING				   PIC X.
 01  ENVMAXSTRINGSIZE			   PIC S9(9) BINARY.
 01  ENVSTRINGSIZE			   PIC S9(9) BINARY.
 01  ENVRESULT				   PIC S9(9) BINARY.

 01  CTRLBRK-SWITCH			   PIC S9(9) BINARY.
     88  CTRLBRK-INTERCEPT		   VALUE 1.
     88  CTRLBRK-NORMAL 		   VALUE 0.

 01  CTRLBRK-TEST			   PIC S9(9) BINARY.
     88  CTRLBRK-FOUND			   VALUE 1.
     88  CTRLBRK-NOT-FOUND		   VALUE 0.

 01  MEMRESULT				   PIC S9(9) BINARY.
     88  MEMRESULT-OK			   VALUE 0.
     88  MEMRESULT-FAIL 		   VALUE 1.
 01  BUFFPTR				   POINTER.
 01  BUFFSIZE				   PIC S9(9) BINARY.
 01  BASEPTR				   POINTER.
 01  BASESIZE				   PIC S9(9) BINARY.
 01  DIRECTORY-NAME			   PIC X(256).
 01  DIRECTORY-LENGTH			   PIC S9(9) BINARY.
 01  SEARCH-HANDLE			   POINTER.
 01  COBOLFILESEARCH.
     05  FILEATTRS			   PIC 9(9) BINARY.
	 88  FILE-ATTRIBUTE-READONLY	   VALUE H'00000001'.
	 88  FILE-ATTRIBUTE-HIDDEN	   VALUE H'00000002'.
	 88  FILE-ATTRIBUTE-SYSTEM	   VALUE H'00000004'.
	 88  FILE-ATTRIBUTE-DIRECTORY	   VALUE H'00000010'.
	 88  FILE-ATTRIBUTE-ARCHIVE	   VALUE H'00000020'.
	 88  FILE-ATTRIBUTE-NORMAL	   VALUE H'00000080'.
	 88  FILE-ATTRIBUTE-TEMPORARY	   VALUE H'00000100'.
	 88  FILE-ATTRIBUTE-COMPRESSED	   VALUE H'00000800'.
     05  FILESIZE			   PIC 9(18) BINARY.
* The time format is the standard structure used
*   COBOL instrinsic date functions
     05  CREATIONTIME.
	 10  CREATIONTIME-YEAR		   PIC 9999.
	 10  CREATIONTIME-MONTH 	   PIC 99.
	 10  CREATIONTIME-DAY		   PIC 99.
	 10  CREATIONTIME-HOUR		   PIC 99.
	 10  CREATIONTIME-MINUTE	   PIC 99.
	 10  CREATIONTIME-SECOND	   PIC 99.
	 10  CREATIONTIME-HUNDREDTHS	   PIC 99.
     05  LASTACCESS.
	 10  LASTACCESS-YEAR		   PIC 9999.
	 10  LASTACCESS-MONTH		   PIC 99.
	 10  LASTACCESS-DAY		   PIC 99.
	 10  LASTACCESS-HOUR		   PIC 99.
	 10  LASTACCESS-MINUTE		   PIC 99.
	 10  LASTACCESS-SECOND		   PIC 99.
	 10  LASTACCESS-HUNDREDTHS	   PIC 99.
     05  LASTWRITE.
	 10  LASTWRITE-YEAR		   PIC 9999.
	 10  LASTWRITE-MONTH		   PIC 99.
	 10  LASTWRITE-DAY		   PIC 99.
	 10  LASTWRITE-HOUR		   PIC 99.
	 10  LASTWRITE-MINUTE		   PIC 99.
	 10  LASTWRITE-SECOND		   PIC 99.
	 10  LASTWRITE-HUNDREDTHS	   PIC 99.
     05  FULLFILENAME			   PIC X(260).
 01  SEARCHFILENAME			   PIC X.
 01  SEARCHRESULT			   PIC S9(9) BINARY.
     88  SEARCH-OK			   VALUE 0.
     88  SPECIFICATION-ERROR		   VALUE 1.
     88  FILE-NOT-FOUMD 		   VALUE 2.
     88  NO-MORE-FILES			   VALUE 18.
 01  EXENAME				   PIC X.
 01  PATHSRCH-FLAGS			   PIC X.
     88  PATHSRCH-NORMAL		   VALUE X'00'.
     88  PATHSRCH-EXACT-SEARCH		   VALUE X'01'.
     88  PATHSRCH-DLL-SEARCH		   VALUE X'02'.
 01  MAINRESULT 			   PIC S9(9) BINARY.
     88  PROGRAM-IS-MAIN		   VALUE 0.
     88  PROGRAM-NOT-MAIN		   VALUE 1.

 PROCEDURE DIVISION.

     ENTRY 'R_REALIA_GETMAIN'
	 USING BY REFERENCE BUFFPTR
	       BY CONTENT BUFFSIZE
	 RETURNING MEMRESULT.

     ENTRY 'R_REALIA_FREEMAIN'
	 USING BY REFERENCE BUFFPTR
	       BY CONTENT BUFFSIZE
	 RETURNING MEMRESULT.

     ENTRY 'R_REALIA_QUERY_MEMSIZE'
	 USING BY REFERENCE BUFFPTR
	       BY REFERENCE BUFFSIZE
	 RETURNING MEMRESULT.

     ENTRY 'R_REALIA_QUERY_MEMBASE'
	 USING BY REFERENCE BUFFPTR
	       BY REFERENCE BASEPTR
	       BY REFERENCE BASESIZE
	 RETURNING MEMRESULT.

     ENTRY 'R_REALIA_GET_PARM_COUNT'
	 USING BY REFERENCE PARMCOUNT.

     ENTRY 'R_REALIA_GET_COMMAND_NAME'
	 USING BY REFERENCE COMMANDNAME
	       BY CONTENT COMMANDMAXSIZE
	 RETURNING COMMANDSIZE.

     ENTRY 'R_REALIA_GET_COMMAND_TAIL'
	 USING BY REFERENCE PARMLINE
	       BY CONTENT PARMMAXSIZE
	 RETURNING PARMSIZE.

     ENTRY 'R_REALIA_GET_ENV_STRING'
	 USING BY REFERENCE ENVNAME DELIMITED
	       BY REFERENCE ENVSTRING
	       BY CONTENT   ENVMAXSTRINGSIZE
	 RETURNING ENVSTRINGSIZE.

     ENTRY 'R_REALIA_PUT_ENV_STRING'
	 USING BY REFERENCE ENVNAME DELIMITED
	       BY REFERENCE ENVSTRING DELIMITED
	 RETURNING ENVRESULT.

     ENTRY 'R_REALIA_GET_CTRLBRK_HANDLING'
	 USING BY REFERENCE CTRLBRK-SWITCH.

     ENTRY 'R_REALIA_SET_CTRLBRK_HANDLING'
	 USING BY REFERENCE CTRLBRK-SWITCH.

     ENTRY 'R_REALIA_TEST_CTRLBRK'
	 USING BY REFERENCE CTRLBRK-TEST.

     ENTRY 'R_REALIA_GET_OS_MODE'
	 USING OSMODE.

     ENTRY 'R_REALIA_GET_CURRENT_DIRECTORY'
	 USING BY REFERENCE DIRECTORY-NAME
	       BY REFERENCE DIRECTORY-LENGTH
	 RETURNING SYSERRCODE.

     ENTRY 'R_REALIA_SET_CURRENT_DIRECTORY'
	 USING BY REFERENCE DIRECTORY-NAME DELIMITED
	 RETURNING SYSERRCODE.

     ENTRY 'R_REALIA_GET_MACHINE_NAME'
	 USING BY REFERENCE MACHINENAME
	       BY CONTENT MACHINENAMEMAXSIZE
	 RETURNING MACHINENAMESIZE.

     ENTRY 'R_REALIA_CREATE_UNIQUE_FILE'
	 USING BY REFERENCE FILENAME
	       BY REFERENCE FILEDIRECTORY DELIMITED
	       BY CONTENT   FILEMAXNAMESIZE
	 RETURNING FILENAMESIZE.

     ENTRY 'R_REALIA_FINDFIRST'
	 USING BY REFERENCE SEARCH-HANDLE
	       BY REFERENCE SEARCHFILENAME DELIMITED
	       BY REFERENCE COBOLFILESEARCH
	 RETURNING SEARCHRESULT.

     ENTRY 'R_REALIA_FINDNEXT'
	 USING BY REFERENCE SEARCH-HANDLE
	       BY REFERENCE COBOLFILESEARCH
	 RETURNING SEARCHRESULT.

     ENTRY 'R_REALIA_FINDCLOSE'
	 USING BY REFERENCE SEARCH-HANDLE.

     ENTRY 'R_REALIA_PATHSRCH_FIRST'
	 USING BY REFERENCE SEARCHFILENAME DELIMITED
	       BY REFERENCE COBOLFILESEARCH
	       BY REFERENCE ENVNAME DELIMITED
	       BY REFERENCE EXENAME DELIMITED
	       BY REFERENCE SEARCH-HANDLE
	       BY REFERENCE PATHSRCH-FLAGS
	 RETURNING SEARCHRESULT.

     ENTRY 'R_REALIA_PATHSRCH_NEXT'
	 USING BY REFERENCE COBOLFILESEARCH
	       BY REFERENCE SEARCH-HANDLE
	 RETURNING SEARCHRESULT.

     ENTRY 'R_REALIA_PATHSRCH_CLOSE'
	 USING BY REFERENCE SEARCH-HANDLE.

     ENTRY 'R_REALIA_IS_MAIN'
	 RETURNING MAINRESULT.

     ENTRY 'R_REALIA_EXEC_PROGRAM'
	 USING BY REFERENCE PROCESSHANDLE
	       BY REFERENCE PROGRAMNAME DELIMITED
	       BY REFERENCE COMMANDLINE DELIMITED
	 RETURNING SYSERRCODE.

     ENTRY 'R_REALIA_EXEC_COMMAND'
	 USING BY REFERENCE PROCESSHANDLE
	       BY REFERENCE COMMANDLINE DELIMITED
	 RETURNING SYSERRCODE.

     ENTRY 'R_REALIA_EXEC_WAIT'
	 USING BY CONTENT   PROCESSHANDLE
	       BY REFERENCE EXITCODEPROCESS
	 RETURNING SYSERRCODE.

     ENTRY 'R_REALIA_EXEC_DETACH'
	 USING BY CONTENT PROCESSHANDLE
	 RETURNING SYSERRCODE.

 END PROGRAM REALIA.
*$PP-LIST
