      * SYMBOLIC MAP of sm003 Created by CACXBMS Version 6.0.27
       01  SM003MI.
	   02  FILLER				      PIC X(12).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(058).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  TIXNUML				      PIC S9(4) COMP.
	   02  TIXNUMF				      PIC X.
	   02  FILLER REDEFINES TIXNUMF.
	       03  TIXNUMA			      PIC X.
	   02  TIXNUMI				      PIC X(006).
	   02  REQBYL				      PIC S9(4) COMP.
	   02  REQBYF				      PIC X.
	   02  FILLER REDEFINES REQBYF.
	       03  REQBYA			      PIC X.
	   02  REQBYI				      PIC X(006).
	   02  TIXTTLL				      PIC S9(4) COMP.
	   02  TIXTTLF				      PIC X.
	   02  FILLER REDEFINES TIXTTLF.
	       03  TIXTTLA			      PIC X.
	   02  TIXTTLI				      PIC X(025).
	   02  TIXDESC1L			      PIC S9(4) COMP.
	   02  TIXDESC1F			      PIC X.
	   02  FILLER REDEFINES TIXDESC1F.
	       03  TIXDESC1A			      PIC X.
	   02  TIXDESC1I			      PIC X(040).
	   02  TIXDESC2L			      PIC S9(4) COMP.
	   02  TIXDESC2F			      PIC X.
	   02  FILLER REDEFINES TIXDESC2F.
	       03  TIXDESC2A			      PIC X.
	   02  TIXDESC2I			      PIC X(040).
	   02  STATL				      PIC S9(4) COMP.
	   02  STATF				      PIC X.
	   02  FILLER REDEFINES STATF.
	       03  STATA			      PIC X.
	   02  STATI				      PIC X(006).
	   02  UPDBYL				      PIC S9(4) COMP.
	   02  UPDBYF				      PIC X.
	   02  FILLER REDEFINES UPDBYF.
	       03  UPDBYA			      PIC X.
	   02  UPDBYI				      PIC X(006).
	   02  UPDRMKL				      PIC S9(4) COMP.
	   02  UPDRMKF				      PIC X.
	   02  FILLER REDEFINES UPDRMKF.
	       03  UPDRMKA			      PIC X.
	   02  UPDRMKI				      PIC X(025).
	   02  UPDRMK1L 			      PIC S9(4) COMP.
	   02  UPDRMK1F 			      PIC X.
	   02  FILLER REDEFINES UPDRMK1F.
	       03  UPDRMK1A			      PIC X.
	   02  UPDRMK1I 			      PIC X(025).
	   02  DATE1L				      PIC S9(4) COMP.
	   02  DATE1F				      PIC X.
	   02  FILLER REDEFINES DATE1F.
	       03  DATE1A			      PIC X.
	   02  DATE1I				      PIC X(010).
	   02  TIME1L				      PIC S9(4) COMP.
	   02  TIME1F				      PIC X.
	   02  FILLER REDEFINES TIME1F.
	       03  TIME1A			      PIC X.
	   02  TIME1I				      PIC X(008).
       01  SM003MO REDEFINES SM003MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(058).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIXNUMO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQBYO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIXTTLO				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIXDESC1O			      PIC X(040).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIXDESC2O			      PIC X(040).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDBYO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDRMKO				      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPDRMK1O 			      PIC X(025).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATE1O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIME1O				      PIC X(008).
