      * SYMBOLIC MAP of ua001s Created by CACXBMS Version 6.0.27
       01  UA001MI.
	   02  FILLER				      PIC X(12).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  PAGEL				      PIC S9(4) COMP.
	   02  PAGEF				      PIC X.
	   02  FILLER REDEFINES PAGEF.
	       03  PAGEA			      PIC X.
	   02  PAGEI				      PIC X(002).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  USERL				      PIC S9(4) COMP.
	   02  USERF				      PIC X.
	   02  FILLER REDEFINES USERF.
	       03  USERA			      PIC X.
	   02  USERI				      PIC X(006).
	   02  OPTN1L				      PIC S9(4) COMP.
	   02  OPTN1F				      PIC X.
	   02  FILLER REDEFINES OPTN1F.
	       03  OPTN1A			      PIC X.
	   02  OPTN1I				      PIC X(001).
	   02  OPTN2L				      PIC S9(4) COMP.
	   02  OPTN2F				      PIC X.
	   02  FILLER REDEFINES OPTN2F.
	       03  OPTN2A			      PIC X.
	   02  OPTN2I				      PIC X(001).
	   02  OPTN3L				      PIC S9(4) COMP.
	   02  OPTN3F				      PIC X.
	   02  FILLER REDEFINES OPTN3F.
	       03  OPTN3A			      PIC X.
	   02  OPTN3I				      PIC X(001).
	   02  OPTN4L				      PIC S9(4) COMP.
	   02  OPTN4F				      PIC X.
	   02  FILLER REDEFINES OPTN4F.
	       03  OPTN4A			      PIC X.
	   02  OPTN4I				      PIC X(001).
	   02  OPTN5L				      PIC S9(4) COMP.
	   02  OPTN5F				      PIC X.
	   02  FILLER REDEFINES OPTN5F.
	       03  OPTN5A			      PIC X.
	   02  OPTN5I				      PIC X(001).
	   02  OPTN6L				      PIC S9(4) COMP.
	   02  OPTN6F				      PIC X.
	   02  FILLER REDEFINES OPTN6F.
	       03  OPTN6A			      PIC X.
	   02  OPTN6I				      PIC X(001).
	   02  OPTN7L				      PIC S9(4) COMP.
	   02  OPTN7F				      PIC X.
	   02  FILLER REDEFINES OPTN7F.
	       03  OPTN7A			      PIC X.
	   02  OPTN7I				      PIC X(001).
	   02  OPTN8L				      PIC S9(4) COMP.
	   02  OPTN8F				      PIC X.
	   02  FILLER REDEFINES OPTN8F.
	       03  OPTN8A			      PIC X.
	   02  OPTN8I				      PIC X(001).
	   02  OPTN9L				      PIC S9(4) COMP.
	   02  OPTN9F				      PIC X.
	   02  FILLER REDEFINES OPTN9F.
	       03  OPTN9A			      PIC X.
	   02  OPTN9I				      PIC X(001).
	   02  OPTN10L				      PIC S9(4) COMP.
	   02  OPTN10F				      PIC X.
	   02  FILLER REDEFINES OPTN10F.
	       03  OPTN10A			      PIC X.
	   02  OPTN10I				      PIC X(001).
	   02  OPTN11L				      PIC S9(4) COMP.
	   02  OPTN11F				      PIC X.
	   02  FILLER REDEFINES OPTN11F.
	       03  OPTN11A			      PIC X.
	   02  OPTN11I				      PIC X(001).
	   02  USER1L				      PIC S9(4) COMP.
	   02  USER1F				      PIC X.
	   02  FILLER REDEFINES USER1F.
	       03  USER1A			      PIC X.
	   02  USER1I				      PIC X(006).
	   02  USER2L				      PIC S9(4) COMP.
	   02  USER2F				      PIC X.
	   02  FILLER REDEFINES USER2F.
	       03  USER2A			      PIC X.
	   02  USER2I				      PIC X(006).
	   02  USER3L				      PIC S9(4) COMP.
	   02  USER3F				      PIC X.
	   02  FILLER REDEFINES USER3F.
	       03  USER3A			      PIC X.
	   02  USER3I				      PIC X(006).
	   02  USER4L				      PIC S9(4) COMP.
	   02  USER4F				      PIC X.
	   02  FILLER REDEFINES USER4F.
	       03  USER4A			      PIC X.
	   02  USER4I				      PIC X(006).
	   02  USER5L				      PIC S9(4) COMP.
	   02  USER5F				      PIC X.
	   02  FILLER REDEFINES USER5F.
	       03  USER5A			      PIC X.
	   02  USER5I				      PIC X(006).
	   02  USER6L				      PIC S9(4) COMP.
	   02  USER6F				      PIC X.
	   02  FILLER REDEFINES USER6F.
	       03  USER6A			      PIC X.
	   02  USER6I				      PIC X(006).
	   02  USER7L				      PIC S9(4) COMP.
	   02  USER7F				      PIC X.
	   02  FILLER REDEFINES USER7F.
	       03  USER7A			      PIC X.
	   02  USER7I				      PIC X(006).
	   02  USER8L				      PIC S9(4) COMP.
	   02  USER8F				      PIC X.
	   02  FILLER REDEFINES USER8F.
	       03  USER8A			      PIC X.
	   02  USER8I				      PIC X(006).
	   02  USER9L				      PIC S9(4) COMP.
	   02  USER9F				      PIC X.
	   02  FILLER REDEFINES USER9F.
	       03  USER9A			      PIC X.
	   02  USER9I				      PIC X(006).
	   02  USER10L				      PIC S9(4) COMP.
	   02  USER10F				      PIC X.
	   02  FILLER REDEFINES USER10F.
	       03  USER10A			      PIC X.
	   02  USER10I				      PIC X(006).
	   02  USER11L				      PIC S9(4) COMP.
	   02  USER11F				      PIC X.
	   02  FILLER REDEFINES USER11F.
	       03  USER11A			      PIC X.
	   02  USER11I				      PIC X(006).
	   02  REQ1L				      PIC S9(4) COMP.
	   02  REQ1F				      PIC X.
	   02  FILLER REDEFINES REQ1F.
	       03  REQ1A			      PIC X.
	   02  REQ1I				      PIC X(001).
	   02  REQ2L				      PIC S9(4) COMP.
	   02  REQ2F				      PIC X.
	   02  FILLER REDEFINES REQ2F.
	       03  REQ2A			      PIC X.
	   02  REQ2I				      PIC X(001).
	   02  REQ3L				      PIC S9(4) COMP.
	   02  REQ3F				      PIC X.
	   02  FILLER REDEFINES REQ3F.
	       03  REQ3A			      PIC X.
	   02  REQ3I				      PIC X(001).
	   02  REQ4L				      PIC S9(4) COMP.
	   02  REQ4F				      PIC X.
	   02  FILLER REDEFINES REQ4F.
	       03  REQ4A			      PIC X.
	   02  REQ4I				      PIC X(001).
	   02  REQ5L				      PIC S9(4) COMP.
	   02  REQ5F				      PIC X.
	   02  FILLER REDEFINES REQ5F.
	       03  REQ5A			      PIC X.
	   02  REQ5I				      PIC X(001).
	   02  REQ6L				      PIC S9(4) COMP.
	   02  REQ6F				      PIC X.
	   02  FILLER REDEFINES REQ6F.
	       03  REQ6A			      PIC X.
	   02  REQ6I				      PIC X(001).
	   02  REQ7L				      PIC S9(4) COMP.
	   02  REQ7F				      PIC X.
	   02  FILLER REDEFINES REQ7F.
	       03  REQ7A			      PIC X.
	   02  REQ7I				      PIC X(001).
	   02  REQ8L				      PIC S9(4) COMP.
	   02  REQ8F				      PIC X.
	   02  FILLER REDEFINES REQ8F.
	       03  REQ8A			      PIC X.
	   02  REQ8I				      PIC X(001).
	   02  REQ9L				      PIC S9(4) COMP.
	   02  REQ9F				      PIC X.
	   02  FILLER REDEFINES REQ9F.
	       03  REQ9A			      PIC X.
	   02  REQ9I				      PIC X(001).
	   02  REQ10L				      PIC S9(4) COMP.
	   02  REQ10F				      PIC X.
	   02  FILLER REDEFINES REQ10F.
	       03  REQ10A			      PIC X.
	   02  REQ10I				      PIC X(001).
	   02  REQ11L				      PIC S9(4) COMP.
	   02  REQ11F				      PIC X.
	   02  FILLER REDEFINES REQ11F.
	       03  REQ11A			      PIC X.
	   02  REQ11I				      PIC X(001).
	   02  ADMIN1L				      PIC S9(4) COMP.
	   02  ADMIN1F				      PIC X.
	   02  FILLER REDEFINES ADMIN1F.
	       03  ADMIN1A			      PIC X.
	   02  ADMIN1I				      PIC X(001).
	   02  ADMIN2L				      PIC S9(4) COMP.
	   02  ADMIN2F				      PIC X.
	   02  FILLER REDEFINES ADMIN2F.
	       03  ADMIN2A			      PIC X.
	   02  ADMIN2I				      PIC X(001).
	   02  ADMIN3L				      PIC S9(4) COMP.
	   02  ADMIN3F				      PIC X.
	   02  FILLER REDEFINES ADMIN3F.
	       03  ADMIN3A			      PIC X.
	   02  ADMIN3I				      PIC X(001).
	   02  ADMIN4L				      PIC S9(4) COMP.
	   02  ADMIN4F				      PIC X.
	   02  FILLER REDEFINES ADMIN4F.
	       03  ADMIN4A			      PIC X.
	   02  ADMIN4I				      PIC X(001).
	   02  ADMIN5L				      PIC S9(4) COMP.
	   02  ADMIN5F				      PIC X.
	   02  FILLER REDEFINES ADMIN5F.
	       03  ADMIN5A			      PIC X.
	   02  ADMIN5I				      PIC X(001).
	   02  ADMIN6L				      PIC S9(4) COMP.
	   02  ADMIN6F				      PIC X.
	   02  FILLER REDEFINES ADMIN6F.
	       03  ADMIN6A			      PIC X.
	   02  ADMIN6I				      PIC X(001).
	   02  ADMIN7L				      PIC S9(4) COMP.
	   02  ADMIN7F				      PIC X.
	   02  FILLER REDEFINES ADMIN7F.
	       03  ADMIN7A			      PIC X.
	   02  ADMIN7I				      PIC X(001).
	   02  ADMIN8L				      PIC S9(4) COMP.
	   02  ADMIN8F				      PIC X.
	   02  FILLER REDEFINES ADMIN8F.
	       03  ADMIN8A			      PIC X.
	   02  ADMIN8I				      PIC X(001).
	   02  ADMIN9L				      PIC S9(4) COMP.
	   02  ADMIN9F				      PIC X.
	   02  FILLER REDEFINES ADMIN9F.
	       03  ADMIN9A			      PIC X.
	   02  ADMIN9I				      PIC X(001).
	   02  ADMIN10L 			      PIC S9(4) COMP.
	   02  ADMIN10F 			      PIC X.
	   02  FILLER REDEFINES ADMIN10F.
	       03  ADMIN10A			      PIC X.
	   02  ADMIN10I 			      PIC X(001).
	   02  ADMIN11L 			      PIC S9(4) COMP.
	   02  ADMIN11F 			      PIC X.
	   02  FILLER REDEFINES ADMIN11F.
	       03  ADMIN11A			      PIC X.
	   02  ADMIN11I 			      PIC X(001).
	   02  APROV1L				      PIC S9(4) COMP.
	   02  APROV1F				      PIC X.
	   02  FILLER REDEFINES APROV1F.
	       03  APROV1A			      PIC X.
	   02  APROV1I				      PIC X(001).
	   02  APROV2L				      PIC S9(4) COMP.
	   02  APROV2F				      PIC X.
	   02  FILLER REDEFINES APROV2F.
	       03  APROV2A			      PIC X.
	   02  APROV2I				      PIC X(001).
	   02  APROV3L				      PIC S9(4) COMP.
	   02  APROV3F				      PIC X.
	   02  FILLER REDEFINES APROV3F.
	       03  APROV3A			      PIC X.
	   02  APROV3I				      PIC X(001).
	   02  APROV4L				      PIC S9(4) COMP.
	   02  APROV4F				      PIC X.
	   02  FILLER REDEFINES APROV4F.
	       03  APROV4A			      PIC X.
	   02  APROV4I				      PIC X(001).
	   02  APROV5L				      PIC S9(4) COMP.
	   02  APROV5F				      PIC X.
	   02  FILLER REDEFINES APROV5F.
	       03  APROV5A			      PIC X.
	   02  APROV5I				      PIC X(001).
	   02  APROV6L				      PIC S9(4) COMP.
	   02  APROV6F				      PIC X.
	   02  FILLER REDEFINES APROV6F.
	       03  APROV6A			      PIC X.
	   02  APROV6I				      PIC X(001).
	   02  APROV7L				      PIC S9(4) COMP.
	   02  APROV7F				      PIC X.
	   02  FILLER REDEFINES APROV7F.
	       03  APROV7A			      PIC X.
	   02  APROV7I				      PIC X(001).
	   02  APROV8L				      PIC S9(4) COMP.
	   02  APROV8F				      PIC X.
	   02  FILLER REDEFINES APROV8F.
	       03  APROV8A			      PIC X.
	   02  APROV8I				      PIC X(001).
	   02  APROV9L				      PIC S9(4) COMP.
	   02  APROV9F				      PIC X.
	   02  FILLER REDEFINES APROV9F.
	       03  APROV9A			      PIC X.
	   02  APROV9I				      PIC X(001).
	   02  APROV10L 			      PIC S9(4) COMP.
	   02  APROV10F 			      PIC X.
	   02  FILLER REDEFINES APROV10F.
	       03  APROV10A			      PIC X.
	   02  APROV10I 			      PIC X(001).
	   02  APROV11L 			      PIC S9(4) COMP.
	   02  APROV11F 			      PIC X.
	   02  FILLER REDEFINES APROV11F.
	       03  APROV11A			      PIC X.
	   02  APROV11I 			      PIC X(001).
	   02  SERV1L				      PIC S9(4) COMP.
	   02  SERV1F				      PIC X.
	   02  FILLER REDEFINES SERV1F.
	       03  SERV1A			      PIC X.
	   02  SERV1I				      PIC X(001).
	   02  SERV2L				      PIC S9(4) COMP.
	   02  SERV2F				      PIC X.
	   02  FILLER REDEFINES SERV2F.
	       03  SERV2A			      PIC X.
	   02  SERV2I				      PIC X(001).
	   02  SERV3L				      PIC S9(4) COMP.
	   02  SERV3F				      PIC X.
	   02  FILLER REDEFINES SERV3F.
	       03  SERV3A			      PIC X.
	   02  SERV3I				      PIC X(001).
	   02  SERV4L				      PIC S9(4) COMP.
	   02  SERV4F				      PIC X.
	   02  FILLER REDEFINES SERV4F.
	       03  SERV4A			      PIC X.
	   02  SERV4I				      PIC X(001).
	   02  SERV5L				      PIC S9(4) COMP.
	   02  SERV5F				      PIC X.
	   02  FILLER REDEFINES SERV5F.
	       03  SERV5A			      PIC X.
	   02  SERV5I				      PIC X(001).
	   02  SERV6L				      PIC S9(4) COMP.
	   02  SERV6F				      PIC X.
	   02  FILLER REDEFINES SERV6F.
	       03  SERV6A			      PIC X.
	   02  SERV6I				      PIC X(001).
	   02  SERV7L				      PIC S9(4) COMP.
	   02  SERV7F				      PIC X.
	   02  FILLER REDEFINES SERV7F.
	       03  SERV7A			      PIC X.
	   02  SERV7I				      PIC X(001).
	   02  SERV8L				      PIC S9(4) COMP.
	   02  SERV8F				      PIC X.
	   02  FILLER REDEFINES SERV8F.
	       03  SERV8A			      PIC X.
	   02  SERV8I				      PIC X(001).
	   02  SERV9L				      PIC S9(4) COMP.
	   02  SERV9F				      PIC X.
	   02  FILLER REDEFINES SERV9F.
	       03  SERV9A			      PIC X.
	   02  SERV9I				      PIC X(001).
	   02  SERV10L				      PIC S9(4) COMP.
	   02  SERV10F				      PIC X.
	   02  FILLER REDEFINES SERV10F.
	       03  SERV10A			      PIC X.
	   02  SERV10I				      PIC X(001).
	   02  SERV11L				      PIC S9(4) COMP.
	   02  SERV11F				      PIC X.
	   02  FILLER REDEFINES SERV11F.
	       03  SERV11A			      PIC X.
	   02  SERV11I				      PIC X(001).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
       01  UA001MO REDEFINES UA001MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  PAGEO				      PIC X(002).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USERO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTN11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER1O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER2O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER3O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER4O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER5O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER6O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER7O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER8O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER9O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER10O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USER11O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN10O 			      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMIN11O 			      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV10O 			      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APROV11O 			      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SERV11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
