      * SYMBOLIC MAP of ua001s Created by CACXBMS Version 6.0.27
       01  UA001MI.
	   02  FILLER				      PIC X(12).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  PAGEL				      PIC S9(4) COMP.
	   02  PAGEF				      PIC X.
	   02  FILLER REDEFINES PAGEF.
	       03  PAGEA			      PIC X.
	   02  PAGEI				      PIC X(002).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  USERIDL				      PIC S9(4) COMP.
	   02  USERIDF				      PIC X.
	   02  FILLER REDEFINES USERIDF.
	       03  USERIDA			      PIC X.
	   02  USERIDI				      PIC X(008).
	   02  UD1L				      PIC S9(4) COMP.
	   02  UD1F				      PIC X.
	   02  FILLER REDEFINES UD1F.
	       03  UD1A 			      PIC X.
	   02  UD1I				      PIC X(001).
	   02  UD2L				      PIC S9(4) COMP.
	   02  UD2F				      PIC X.
	   02  FILLER REDEFINES UD2F.
	       03  UD2A 			      PIC X.
	   02  UD2I				      PIC X(001).
	   02  UD3L				      PIC S9(4) COMP.
	   02  UD3F				      PIC X.
	   02  FILLER REDEFINES UD3F.
	       03  UD3A 			      PIC X.
	   02  UD3I				      PIC X(001).
	   02  UD4L				      PIC S9(4) COMP.
	   02  UD4F				      PIC X.
	   02  FILLER REDEFINES UD4F.
	       03  UD4A 			      PIC X.
	   02  UD4I				      PIC X(001).
	   02  UD5L				      PIC S9(4) COMP.
	   02  UD5F				      PIC X.
	   02  FILLER REDEFINES UD5F.
	       03  UD5A 			      PIC X.
	   02  UD5I				      PIC X(001).
	   02  UD6L				      PIC S9(4) COMP.
	   02  UD6F				      PIC X.
	   02  FILLER REDEFINES UD6F.
	       03  UD6A 			      PIC X.
	   02  UD6I				      PIC X(001).
	   02  UD7L				      PIC S9(4) COMP.
	   02  UD7F				      PIC X.
	   02  FILLER REDEFINES UD7F.
	       03  UD7A 			      PIC X.
	   02  UD7I				      PIC X(001).
	   02  UD8L				      PIC S9(4) COMP.
	   02  UD8F				      PIC X.
	   02  FILLER REDEFINES UD8F.
	       03  UD8A 			      PIC X.
	   02  UD8I				      PIC X(001).
	   02  UD9L				      PIC S9(4) COMP.
	   02  UD9F				      PIC X.
	   02  FILLER REDEFINES UD9F.
	       03  UD9A 			      PIC X.
	   02  UD9I				      PIC X(001).
	   02  UD10L				      PIC S9(4) COMP.
	   02  UD10F				      PIC X.
	   02  FILLER REDEFINES UD10F.
	       03  UD10A			      PIC X.
	   02  UD10I				      PIC X(001).
	   02  UD11L				      PIC S9(4) COMP.
	   02  UD11F				      PIC X.
	   02  FILLER REDEFINES UD11F.
	       03  UD11A			      PIC X.
	   02  UD11I				      PIC X(001).
	   02  UID1L				      PIC S9(4) COMP.
	   02  UID1F				      PIC X.
	   02  FILLER REDEFINES UID1F.
	       03  UID1A			      PIC X.
	   02  UID1I				      PIC X(008).
	   02  UID2L				      PIC S9(4) COMP.
	   02  UID2F				      PIC X.
	   02  FILLER REDEFINES UID2F.
	       03  UID2A			      PIC X.
	   02  UID2I				      PIC X(008).
	   02  UID3L				      PIC S9(4) COMP.
	   02  UID3F				      PIC X.
	   02  FILLER REDEFINES UID3F.
	       03  UID3A			      PIC X.
	   02  UID3I				      PIC X(008).
	   02  UID4L				      PIC S9(4) COMP.
	   02  UID4F				      PIC X.
	   02  FILLER REDEFINES UID4F.
	       03  UID4A			      PIC X.
	   02  UID4I				      PIC X(008).
	   02  UID5L				      PIC S9(4) COMP.
	   02  UID5F				      PIC X.
	   02  FILLER REDEFINES UID5F.
	       03  UID5A			      PIC X.
	   02  UID5I				      PIC X(008).
	   02  UID6L				      PIC S9(4) COMP.
	   02  UID6F				      PIC X.
	   02  FILLER REDEFINES UID6F.
	       03  UID6A			      PIC X.
	   02  UID6I				      PIC X(008).
	   02  UID7L				      PIC S9(4) COMP.
	   02  UID7F				      PIC X.
	   02  FILLER REDEFINES UID7F.
	       03  UID7A			      PIC X.
	   02  UID7I				      PIC X(008).
	   02  UID8L				      PIC S9(4) COMP.
	   02  UID8F				      PIC X.
	   02  FILLER REDEFINES UID8F.
	       03  UID8A			      PIC X.
	   02  UID8I				      PIC X(008).
	   02  UID9L				      PIC S9(4) COMP.
	   02  UID9F				      PIC X.
	   02  FILLER REDEFINES UID9F.
	       03  UID9A			      PIC X.
	   02  UID9I				      PIC X(008).
	   02  UID10L				      PIC S9(4) COMP.
	   02  UID10F				      PIC X.
	   02  FILLER REDEFINES UID10F.
	       03  UID10A			      PIC X.
	   02  UID10I				      PIC X(008).
	   02  UID11L				      PIC S9(4) COMP.
	   02  UID11F				      PIC X.
	   02  FILLER REDEFINES UID11F.
	       03  UID11A			      PIC X.
	   02  UID11I				      PIC X(008).
	   02  REQ1L				      PIC S9(4) COMP.
	   02  REQ1F				      PIC X.
	   02  FILLER REDEFINES REQ1F.
	       03  REQ1A			      PIC X.
	   02  REQ1I				      PIC X(001).
	   02  REQ2L				      PIC S9(4) COMP.
	   02  REQ2F				      PIC X.
	   02  FILLER REDEFINES REQ2F.
	       03  REQ2A			      PIC X.
	   02  REQ2I				      PIC X(001).
	   02  REQ3L				      PIC S9(4) COMP.
	   02  REQ3F				      PIC X.
	   02  FILLER REDEFINES REQ3F.
	       03  REQ3A			      PIC X.
	   02  REQ3I				      PIC X(001).
	   02  REQ4L				      PIC S9(4) COMP.
	   02  REQ4F				      PIC X.
	   02  FILLER REDEFINES REQ4F.
	       03  REQ4A			      PIC X.
	   02  REQ4I				      PIC X(001).
	   02  REQ5L				      PIC S9(4) COMP.
	   02  REQ5F				      PIC X.
	   02  FILLER REDEFINES REQ5F.
	       03  REQ5A			      PIC X.
	   02  REQ5I				      PIC X(001).
	   02  REQ6L				      PIC S9(4) COMP.
	   02  REQ6F				      PIC X.
	   02  FILLER REDEFINES REQ6F.
	       03  REQ6A			      PIC X.
	   02  REQ6I				      PIC X(001).
	   02  REQ7L				      PIC S9(4) COMP.
	   02  REQ7F				      PIC X.
	   02  FILLER REDEFINES REQ7F.
	       03  REQ7A			      PIC X.
	   02  REQ7I				      PIC X(001).
	   02  REQ8L				      PIC S9(4) COMP.
	   02  REQ8F				      PIC X.
	   02  FILLER REDEFINES REQ8F.
	       03  REQ8A			      PIC X.
	   02  REQ8I				      PIC X(001).
	   02  REQ9L				      PIC S9(4) COMP.
	   02  REQ9F				      PIC X.
	   02  FILLER REDEFINES REQ9F.
	       03  REQ9A			      PIC X.
	   02  REQ9I				      PIC X(001).
	   02  REQ10L				      PIC S9(4) COMP.
	   02  REQ10F				      PIC X.
	   02  FILLER REDEFINES REQ10F.
	       03  REQ10A			      PIC X.
	   02  REQ10I				      PIC X(001).
	   02  REQ11L				      PIC S9(4) COMP.
	   02  REQ11F				      PIC X.
	   02  FILLER REDEFINES REQ11F.
	       03  REQ11A			      PIC X.
	   02  REQ11I				      PIC X(001).
	   02  ADMN1L				      PIC S9(4) COMP.
	   02  ADMN1F				      PIC X.
	   02  FILLER REDEFINES ADMN1F.
	       03  ADMN1A			      PIC X.
	   02  ADMN1I				      PIC X(001).
	   02  ADMN2L				      PIC S9(4) COMP.
	   02  ADMN2F				      PIC X.
	   02  FILLER REDEFINES ADMN2F.
	       03  ADMN2A			      PIC X.
	   02  ADMN2I				      PIC X(001).
	   02  ADMN3L				      PIC S9(4) COMP.
	   02  ADMN3F				      PIC X.
	   02  FILLER REDEFINES ADMN3F.
	       03  ADMN3A			      PIC X.
	   02  ADMN3I				      PIC X(001).
	   02  ADMN4L				      PIC S9(4) COMP.
	   02  ADMN4F				      PIC X.
	   02  FILLER REDEFINES ADMN4F.
	       03  ADMN4A			      PIC X.
	   02  ADMN4I				      PIC X(001).
	   02  ADMN5L				      PIC S9(4) COMP.
	   02  ADMN5F				      PIC X.
	   02  FILLER REDEFINES ADMN5F.
	       03  ADMN5A			      PIC X.
	   02  ADMN5I				      PIC X(001).
	   02  ADMN6L				      PIC S9(4) COMP.
	   02  ADMN6F				      PIC X.
	   02  FILLER REDEFINES ADMN6F.
	       03  ADMN6A			      PIC X.
	   02  ADMN6I				      PIC X(001).
	   02  ADMN7L				      PIC S9(4) COMP.
	   02  ADMN7F				      PIC X.
	   02  FILLER REDEFINES ADMN7F.
	       03  ADMN7A			      PIC X.
	   02  ADMN7I				      PIC X(001).
	   02  ADMN8L				      PIC S9(4) COMP.
	   02  ADMN8F				      PIC X.
	   02  FILLER REDEFINES ADMN8F.
	       03  ADMN8A			      PIC X.
	   02  ADMN8I				      PIC X(001).
	   02  ADMN9L				      PIC S9(4) COMP.
	   02  ADMN9F				      PIC X.
	   02  FILLER REDEFINES ADMN9F.
	       03  ADMN9A			      PIC X.
	   02  ADMN9I				      PIC X(001).
	   02  ADMN10L				      PIC S9(4) COMP.
	   02  ADMN10F				      PIC X.
	   02  FILLER REDEFINES ADMN10F.
	       03  ADMN10A			      PIC X.
	   02  ADMN10I				      PIC X(001).
	   02  ADMN11L				      PIC S9(4) COMP.
	   02  ADMN11F				      PIC X.
	   02  FILLER REDEFINES ADMN11F.
	       03  ADMN11A			      PIC X.
	   02  ADMN11I				      PIC X(001).
	   02  APP1L				      PIC S9(4) COMP.
	   02  APP1F				      PIC X.
	   02  FILLER REDEFINES APP1F.
	       03  APP1A			      PIC X.
	   02  APP1I				      PIC X(001).
	   02  APP2L				      PIC S9(4) COMP.
	   02  APP2F				      PIC X.
	   02  FILLER REDEFINES APP2F.
	       03  APP2A			      PIC X.
	   02  APP2I				      PIC X(001).
	   02  APP3L				      PIC S9(4) COMP.
	   02  APP3F				      PIC X.
	   02  FILLER REDEFINES APP3F.
	       03  APP3A			      PIC X.
	   02  APP3I				      PIC X(001).
	   02  APP4L				      PIC S9(4) COMP.
	   02  APP4F				      PIC X.
	   02  FILLER REDEFINES APP4F.
	       03  APP4A			      PIC X.
	   02  APP4I				      PIC X(001).
	   02  APP5L				      PIC S9(4) COMP.
	   02  APP5F				      PIC X.
	   02  FILLER REDEFINES APP5F.
	       03  APP5A			      PIC X.
	   02  APP5I				      PIC X(001).
	   02  APP6L				      PIC S9(4) COMP.
	   02  APP6F				      PIC X.
	   02  FILLER REDEFINES APP6F.
	       03  APP6A			      PIC X.
	   02  APP6I				      PIC X(001).
	   02  APP7L				      PIC S9(4) COMP.
	   02  APP7F				      PIC X.
	   02  FILLER REDEFINES APP7F.
	       03  APP7A			      PIC X.
	   02  APP7I				      PIC X(001).
	   02  APP8L				      PIC S9(4) COMP.
	   02  APP8F				      PIC X.
	   02  FILLER REDEFINES APP8F.
	       03  APP8A			      PIC X.
	   02  APP8I				      PIC X(001).
	   02  APP9L				      PIC S9(4) COMP.
	   02  APP9F				      PIC X.
	   02  FILLER REDEFINES APP9F.
	       03  APP9A			      PIC X.
	   02  APP9I				      PIC X(001).
	   02  APP10L				      PIC S9(4) COMP.
	   02  APP10F				      PIC X.
	   02  FILLER REDEFINES APP10F.
	       03  APP10A			      PIC X.
	   02  APP10I				      PIC X(001).
	   02  APP11L				      PIC S9(4) COMP.
	   02  APP11F				      PIC X.
	   02  FILLER REDEFINES APP11F.
	       03  APP11A			      PIC X.
	   02  APP11I				      PIC X(001).
	   02  SP1L				      PIC S9(4) COMP.
	   02  SP1F				      PIC X.
	   02  FILLER REDEFINES SP1F.
	       03  SP1A 			      PIC X.
	   02  SP1I				      PIC X(001).
	   02  SP2L				      PIC S9(4) COMP.
	   02  SP2F				      PIC X.
	   02  FILLER REDEFINES SP2F.
	       03  SP2A 			      PIC X.
	   02  SP2I				      PIC X(001).
	   02  SP3L				      PIC S9(4) COMP.
	   02  SP3F				      PIC X.
	   02  FILLER REDEFINES SP3F.
	       03  SP3A 			      PIC X.
	   02  SP3I				      PIC X(001).
	   02  SP4L				      PIC S9(4) COMP.
	   02  SP4F				      PIC X.
	   02  FILLER REDEFINES SP4F.
	       03  SP4A 			      PIC X.
	   02  SP4I				      PIC X(001).
	   02  SP5L				      PIC S9(4) COMP.
	   02  SP5F				      PIC X.
	   02  FILLER REDEFINES SP5F.
	       03  SP5A 			      PIC X.
	   02  SP5I				      PIC X(001).
	   02  SP6L				      PIC S9(4) COMP.
	   02  SP6F				      PIC X.
	   02  FILLER REDEFINES SP6F.
	       03  SP6A 			      PIC X.
	   02  SP6I				      PIC X(001).
	   02  SP7L				      PIC S9(4) COMP.
	   02  SP7F				      PIC X.
	   02  FILLER REDEFINES SP7F.
	       03  SP7A 			      PIC X.
	   02  SP7I				      PIC X(001).
	   02  SP8L				      PIC S9(4) COMP.
	   02  SP8F				      PIC X.
	   02  FILLER REDEFINES SP8F.
	       03  SP8A 			      PIC X.
	   02  SP8I				      PIC X(001).
	   02  SP9L				      PIC S9(4) COMP.
	   02  SP9F				      PIC X.
	   02  FILLER REDEFINES SP9F.
	       03  SP9A 			      PIC X.
	   02  SP9I				      PIC X(001).
	   02  SP10L				      PIC S9(4) COMP.
	   02  SP10F				      PIC X.
	   02  FILLER REDEFINES SP10F.
	       03  SP10A			      PIC X.
	   02  SP10I				      PIC X(001).
	   02  SP11L				      PIC S9(4) COMP.
	   02  SP11F				      PIC X.
	   02  FILLER REDEFINES SP11F.
	       03  SP11A			      PIC X.
	   02  SP11I				      PIC X(001).
	   02  MSGL				      PIC S9(4) COMP.
	   02  MSGF				      PIC X.
	   02  FILLER REDEFINES MSGF.
	       03  MSGA 			      PIC X.
	   02  MSGI				      PIC X(060).
	   02  ADDL				      PIC S9(4) COMP.
	   02  ADDF				      PIC X.
	   02  FILLER REDEFINES ADDF.
	       03  ADDA 			      PIC X.
	   02  ADDI				      PIC X(009).
	   02  EXITL				      PIC S9(4) COMP.
	   02  EXITF				      PIC X.
	   02  FILLER REDEFINES EXITF.
	       03  EXITA			      PIC X.
	   02  EXITI				      PIC X(010).
	   02  FINDL				      PIC S9(4) COMP.
	   02  FINDF				      PIC X.
	   02  FILLER REDEFINES FINDF.
	       03  FINDA			      PIC X.
	   02  FINDI				      PIC X(010).
	   02  UPL				      PIC S9(4) COMP.
	   02  UPF				      PIC X.
	   02  FILLER REDEFINES UPF.
	       03  UPA				      PIC X.
	   02  UPI				      PIC X(008).
	   02  DOWNL				      PIC S9(4) COMP.
	   02  DOWNF				      PIC X.
	   02  FILLER REDEFINES DOWNF.
	       03  DOWNA			      PIC X.
	   02  DOWNI				      PIC X(010).
	   02  RESETL				      PIC S9(4) COMP.
	   02  RESETF				      PIC X.
	   02  FILLER REDEFINES RESETF.
	       03  RESETA			      PIC X.
	   02  RESETI				      PIC X(012).
       01  UA001MO REDEFINES UA001MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  PAGEO				      PIC X(002).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  USERIDO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID1O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID2O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID3O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID4O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID5O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID6O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID7O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID8O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID9O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID10O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UID11O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  REQ11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADMN11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  APP11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  SP11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  MSGO				      PIC X(060).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADDO				      PIC X(009).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  EXITO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FINDO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DOWNO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  RESETO				      PIC X(012).
