       01  DFHAID.
      *
      * CA-Realia CICS 6.0 Computer Associates International, Inc.
      *
      * Revision Information
      * ^{File:dfhaid.cob  }
      * ^{Timestamp:Thu May 15 14:02:52 1997}
      * ^{Revision:2.0}
      *
      *This is the AID constants copy file
      *
	   05  DFHENTER 		 PIC X VALUE ''''.
      * 				 value APOST
	   05  DFHCLEAR 		 PIC X VALUE '_'.
	   05  DFHPA1			 PIC X VALUE '%'.
	   05  DFHPA2			 PIC X VALUE '>'.
	   05  DFHPA3			 PIC X VALUE ','.
	   05  DFHPF1			 PIC X VALUE '1'.
	   05  DFHPF2			 PIC X VALUE '2'.
	   05  DFHPF3			 PIC X VALUE '3'.
	   05  DFHPF4			 PIC X VALUE '4'.
	   05  DFHPF5			 PIC X VALUE '5'.
	   05  DFHPF6			 PIC X VALUE '6'.
	   05  DFHPF7			 PIC X VALUE '7'.
	   05  DFHPF8			 PIC X VALUE '8'.
	   05  DFHPF9			 PIC X VALUE '9'.
	   05  DFHPF10			 PIC X VALUE ':'.
	   05  DFHPF11			 PIC X VALUE '#'.
	   05  DFHPF12			 PIC X VALUE '@'.
	   05  DFHPF13			 PIC X VALUE 'A'.
	   05  DFHPF14			 PIC X VALUE 'B'.
	   05  DFHPF15			 PIC X VALUE 'C'.
	   05  DFHPF16			 PIC X VALUE 'D'.
	   05  DFHPF17			 PIC X VALUE 'E'.
	   05  DFHPF18			 PIC X VALUE 'F'.
	   05  DFHPF19			 PIC X VALUE 'G'.
	   05  DFHPF20			 PIC X VALUE 'H'.
	   05  DFHPF21			 PIC X VALUE 'I'.
	   05  DFHPF22			 PIC X VALUE '›'.
      * 				 EBCDIC Cent sign x'4A'
      * 				 ASCII	Cent sign x'9B'
	   05  DFHPF23			 PIC X VALUE '.'.
	   05  DFHPF24			 PIC X VALUE '<'.
	   05  DFHOPID			 PIC X VALUE 'W'.
	   05  DFHMSRE			 PIC X VALUE 'X'.
	   05  DFHTRIG			 PIC X VALUE '"'.
      * 				       value QUOTE  "
	   05  DFHPEN			 PIC X VALUE '='.
	   05  DFHCLRP			 PIC X VALUE 'Ý'.
      * 				 EBCDIC x'6A'
      * 				 ASCII	x'DD'
	   05  DFHSTRF			 PIC X VALUE 'h'.
      *    DFHQUIT is a CA-Realia CICS Extension
      *    It is set by using <Ctrl>+C or <Ctrl>+<Break> Keys
	   05  DFHQUIT			 PIC X VALUE '!'.
	   05  DFHNULL			 PIC X VALUE LOW-VALUE.
