 IDENTIFICATION DIVISION.
 PROGRAM-ID. MAINEG.
 AUTHOR.     COMPUTER ASSOCIATES INTERNATIONAL, INC.
 SECURITY.       COPYRIGHT 1989
                 COMPUTER ASSOCIATES INTERNATIONAL INC.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER.   IBM-3090.
 OBJECT-COMPUTER.   IBM-3090.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 FILLER-1 PIC X(30) VALUE "Working Storage STARTS HERE".
 01 PARM-REC.
    05 PARM-FIRST-NAME PIC X(15).
    05 PARM-LAST-NAME  PIC X(15).
*
 PROCEDURE DIVISION.
 MAIN.
     DISPLAY "START MAINEG".
     CALL "SUBEG1" USING PARM-REC.
     CALL "SUBEG2" USING PARM-REC.
     STOP RUN.


