      * SYMBOLIC MAP of sm000s Created by CACXBMS Version 6.0.27
       01  SW00MI.
	   02  FILLER				      PIC X(12).
	   02  OPTCHC1L 			      PIC S9(4) COMP.
	   02  OPTCHC1F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC1F.
	       03  OPTCHC1A			      PIC X.
	   02  OPTCHC1I 			      PIC X(021).
	   02  OPTNO1L				      PIC S9(4) COMP.
	   02  OPTNO1F				      PIC X.
	   02  FILLER REDEFINES OPTNO1F.
	       03  OPTNO1A			      PIC X.
	   02  OPTNO1I				      PIC X(001).
	   02  OPTCHC2L 			      PIC S9(4) COMP.
	   02  OPTCHC2F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC2F.
	       03  OPTCHC2A			      PIC X.
	   02  OPTCHC2I 			      PIC X(021).
	   02  OPTNO2L				      PIC S9(4) COMP.
	   02  OPTNO2F				      PIC X.
	   02  FILLER REDEFINES OPTNO2F.
	       03  OPTNO2A			      PIC X.
	   02  OPTNO2I				      PIC X(001).
	   02  OPTCHC3L 			      PIC S9(4) COMP.
	   02  OPTCHC3F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC3F.
	       03  OPTCHC3A			      PIC X.
	   02  OPTCHC3I 			      PIC X(021).
	   02  OPTNO3L				      PIC S9(4) COMP.
	   02  OPTNO3F				      PIC X.
	   02  FILLER REDEFINES OPTNO3F.
	       03  OPTNO3A			      PIC X.
	   02  OPTNO3I				      PIC X(001).
	   02  OPTCHC4L 			      PIC S9(4) COMP.
	   02  OPTCHC4F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC4F.
	       03  OPTCHC4A			      PIC X.
	   02  OPTCHC4I 			      PIC X(021).
	   02  OPTNO4L				      PIC S9(4) COMP.
	   02  OPTNO4F				      PIC X.
	   02  FILLER REDEFINES OPTNO4F.
	       03  OPTNO4A			      PIC X.
	   02  OPTNO4I				      PIC X(001).
	   02  OPTCHC5L 			      PIC S9(4) COMP.
	   02  OPTCHC5F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC5F.
	       03  OPTCHC5A			      PIC X.
	   02  OPTCHC5I 			      PIC X(021).
	   02  OPTNO5L				      PIC S9(4) COMP.
	   02  OPTNO5F				      PIC X.
	   02  FILLER REDEFINES OPTNO5F.
	       03  OPTNO5A			      PIC X.
	   02  OPTNO5I				      PIC X(001).
	   02  OPTCHC6L 			      PIC S9(4) COMP.
	   02  OPTCHC6F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC6F.
	       03  OPTCHC6A			      PIC X.
	   02  OPTCHC6I 			      PIC X(021).
	   02  OPTNO6L				      PIC S9(4) COMP.
	   02  OPTNO6F				      PIC X.
	   02  FILLER REDEFINES OPTNO6F.
	       03  OPTNO6A			      PIC X.
	   02  OPTNO6I				      PIC X(001).
	   02  OPTCHC7L 			      PIC S9(4) COMP.
	   02  OPTCHC7F 			      PIC X.
	   02  FILLER REDEFINES OPTCHC7F.
	       03  OPTCHC7A			      PIC X.
	   02  OPTCHC7I 			      PIC X(021).
	   02  OPTNO7L				      PIC S9(4) COMP.
	   02  OPTNO7F				      PIC X.
	   02  FILLER REDEFINES OPTNO7F.
	       03  OPTNO7A			      PIC X.
	   02  OPTNO7I				      PIC X(001).
	   02  OPTIONL				      PIC S9(4) COMP.
	   02  OPTIONF				      PIC X.
	   02  FILLER REDEFINES OPTIONF.
	       03  OPTIONA			      PIC X.
	   02  OPTIONI				      PIC X(001).
	   02  TIXNOL				      PIC S9(4) COMP.
	   02  TIXNOF				      PIC X.
	   02  FILLER REDEFINES TIXNOF.
	       03  TIXNOA			      PIC X.
	   02  TIXNOI				      PIC X(006).
	   02  ERRMSGL				      PIC S9(4) COMP.
	   02  ERRMSGF				      PIC X.
	   02  FILLER REDEFINES ERRMSGF.
	       03  ERRMSGA			      PIC X.
	   02  ERRMSGI				      PIC X(071).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
       01  SW00MO REDEFINES SW00MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC1O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC2O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC3O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC4O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC5O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC6O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTCHC7O 			      PIC X(021).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTNO7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  OPTIONO				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIXNOO				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ERRMSGO				      PIC X(071).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
