      * SYMBOLIC MAP of sm001s Created by CACXBMS Version 6.0.27
       01  SM001MI.
	   02  FILLER				      PIC X(12).
	   02  DATEL				      PIC S9(4) COMP.
	   02  DATEF				      PIC X.
	   02  FILLER REDEFINES DATEF.
	       03  DATEA			      PIC X.
	   02  DATEI				      PIC X(010).
	   02  PAGEL				      PIC S9(4) COMP.
	   02  PAGEF				      PIC X.
	   02  FILLER REDEFINES PAGEF.
	       03  PAGEA			      PIC X.
	   02  PAGEI				      PIC X(002).
	   02  TIMEL				      PIC S9(4) COMP.
	   02  TIMEF				      PIC X.
	   02  FILLER REDEFINES TIMEF.
	       03  TIMEA			      PIC X.
	   02  TIMEI				      PIC X(008).
	   02  TITLEL				      PIC S9(4) COMP.
	   02  TITLEF				      PIC X.
	   02  FILLER REDEFINES TITLEF.
	       03  TITLEA			      PIC X.
	   02  TITLEI				      PIC X(020).
	   02  STATUSL				      PIC S9(4) COMP.
	   02  STATUSF				      PIC X.
	   02  FILLER REDEFINES STATUSF.
	       03  STATUSA			      PIC X.
	   02  STATUSI				      PIC X(007).
	   02  TODATEL				      PIC S9(4) COMP.
	   02  TODATEF				      PIC X.
	   02  FILLER REDEFINES TODATEF.
	       03  TODATEA			      PIC X.
	   02  TODATEI				      PIC X(008).
	   02  FRDATEL				      PIC S9(4) COMP.
	   02  FRDATEF				      PIC X.
	   02  FILLER REDEFINES FRDATEF.
	       03  FRDATEA			      PIC X.
	   02  FRDATEI				      PIC X(008).
	   02  UC1L				      PIC S9(4) COMP.
	   02  UC1F				      PIC X.
	   02  FILLER REDEFINES UC1F.
	       03  UC1A 			      PIC X.
	   02  UC1I				      PIC X(001).
	   02  UC2L				      PIC S9(4) COMP.
	   02  UC2F				      PIC X.
	   02  FILLER REDEFINES UC2F.
	       03  UC2A 			      PIC X.
	   02  UC2I				      PIC X(001).
	   02  UC3L				      PIC S9(4) COMP.
	   02  UC3F				      PIC X.
	   02  FILLER REDEFINES UC3F.
	       03  UC3A 			      PIC X.
	   02  UC3I				      PIC X(001).
	   02  UC4L				      PIC S9(4) COMP.
	   02  UC4F				      PIC X.
	   02  FILLER REDEFINES UC4F.
	       03  UC4A 			      PIC X.
	   02  UC4I				      PIC X(001).
	   02  UC5L				      PIC S9(4) COMP.
	   02  UC5F				      PIC X.
	   02  FILLER REDEFINES UC5F.
	       03  UC5A 			      PIC X.
	   02  UC5I				      PIC X(001).
	   02  UC6L				      PIC S9(4) COMP.
	   02  UC6F				      PIC X.
	   02  FILLER REDEFINES UC6F.
	       03  UC6A 			      PIC X.
	   02  UC6I				      PIC X(001).
	   02  UC7L				      PIC S9(4) COMP.
	   02  UC7F				      PIC X.
	   02  FILLER REDEFINES UC7F.
	       03  UC7A 			      PIC X.
	   02  UC7I				      PIC X(001).
	   02  UC8L				      PIC S9(4) COMP.
	   02  UC8F				      PIC X.
	   02  FILLER REDEFINES UC8F.
	       03  UC8A 			      PIC X.
	   02  UC8I				      PIC X(001).
	   02  UC9L				      PIC S9(4) COMP.
	   02  UC9F				      PIC X.
	   02  FILLER REDEFINES UC9F.
	       03  UC9A 			      PIC X.
	   02  UC9I				      PIC X(001).
	   02  UC10L				      PIC S9(4) COMP.
	   02  UC10F				      PIC X.
	   02  FILLER REDEFINES UC10F.
	       03  UC10A			      PIC X.
	   02  UC10I				      PIC X(001).
	   02  UC11L				      PIC S9(4) COMP.
	   02  UC11F				      PIC X.
	   02  FILLER REDEFINES UC11F.
	       03  UC11A			      PIC X.
	   02  UC11I				      PIC X(001).
	   02  TN1L				      PIC S9(4) COMP.
	   02  TN1F				      PIC X.
	   02  FILLER REDEFINES TN1F.
	       03  TN1A 			      PIC X.
	   02  TN1I				      PIC X(006).
	   02  TN2L				      PIC S9(4) COMP.
	   02  TN2F				      PIC X.
	   02  FILLER REDEFINES TN2F.
	       03  TN2A 			      PIC X.
	   02  TN2I				      PIC X(006).
	   02  TN3L				      PIC S9(4) COMP.
	   02  TN3F				      PIC X.
	   02  FILLER REDEFINES TN3F.
	       03  TN3A 			      PIC X.
	   02  TN3I				      PIC X(006).
	   02  TN4L				      PIC S9(4) COMP.
	   02  TN4F				      PIC X.
	   02  FILLER REDEFINES TN4F.
	       03  TN4A 			      PIC X.
	   02  TN4I				      PIC X(006).
	   02  TN5L				      PIC S9(4) COMP.
	   02  TN5F				      PIC X.
	   02  FILLER REDEFINES TN5F.
	       03  TN5A 			      PIC X.
	   02  TN5I				      PIC X(006).
	   02  TN6L				      PIC S9(4) COMP.
	   02  TN6F				      PIC X.
	   02  FILLER REDEFINES TN6F.
	       03  TN6A 			      PIC X.
	   02  TN6I				      PIC X(006).
	   02  TN7L				      PIC S9(4) COMP.
	   02  TN7F				      PIC X.
	   02  FILLER REDEFINES TN7F.
	       03  TN7A 			      PIC X.
	   02  TN7I				      PIC X(006).
	   02  TN8L				      PIC S9(4) COMP.
	   02  TN8F				      PIC X.
	   02  FILLER REDEFINES TN8F.
	       03  TN8A 			      PIC X.
	   02  TN8I				      PIC X(006).
	   02  TN9L				      PIC S9(4) COMP.
	   02  TN9F				      PIC X.
	   02  FILLER REDEFINES TN9F.
	       03  TN9A 			      PIC X.
	   02  TN9I				      PIC X(006).
	   02  TN10L				      PIC S9(4) COMP.
	   02  TN10F				      PIC X.
	   02  FILLER REDEFINES TN10F.
	       03  TN10A			      PIC X.
	   02  TN10I				      PIC X(006).
	   02  TN11L				      PIC S9(4) COMP.
	   02  TN11F				      PIC X.
	   02  FILLER REDEFINES TN11F.
	       03  TN11A			      PIC X.
	   02  TN11I				      PIC X(006).
	   02  TT1L				      PIC S9(4) COMP.
	   02  TT1F				      PIC X.
	   02  FILLER REDEFINES TT1F.
	       03  TT1A 			      PIC X.
	   02  TT1I				      PIC X(020).
	   02  TT2L				      PIC S9(4) COMP.
	   02  TT2F				      PIC X.
	   02  FILLER REDEFINES TT2F.
	       03  TT2A 			      PIC X.
	   02  TT2I				      PIC X(020).
	   02  TT3L				      PIC S9(4) COMP.
	   02  TT3F				      PIC X.
	   02  FILLER REDEFINES TT3F.
	       03  TT3A 			      PIC X.
	   02  TT3I				      PIC X(020).
	   02  TT4L				      PIC S9(4) COMP.
	   02  TT4F				      PIC X.
	   02  FILLER REDEFINES TT4F.
	       03  TT4A 			      PIC X.
	   02  TT4I				      PIC X(020).
	   02  TT5L				      PIC S9(4) COMP.
	   02  TT5F				      PIC X.
	   02  FILLER REDEFINES TT5F.
	       03  TT5A 			      PIC X.
	   02  TT5I				      PIC X(020).
	   02  TT6L				      PIC S9(4) COMP.
	   02  TT6F				      PIC X.
	   02  FILLER REDEFINES TT6F.
	       03  TT6A 			      PIC X.
	   02  TT6I				      PIC X(020).
	   02  TT7L				      PIC S9(4) COMP.
	   02  TT7F				      PIC X.
	   02  FILLER REDEFINES TT7F.
	       03  TT7A 			      PIC X.
	   02  TT7I				      PIC X(020).
	   02  TT8L				      PIC S9(4) COMP.
	   02  TT8F				      PIC X.
	   02  FILLER REDEFINES TT8F.
	       03  TT8A 			      PIC X.
	   02  TT8I				      PIC X(020).
	   02  TT9L				      PIC S9(4) COMP.
	   02  TT9F				      PIC X.
	   02  FILLER REDEFINES TT9F.
	       03  TT9A 			      PIC X.
	   02  TT9I				      PIC X(020).
	   02  TT10L				      PIC S9(4) COMP.
	   02  TT10F				      PIC X.
	   02  FILLER REDEFINES TT10F.
	       03  TT10A			      PIC X.
	   02  TT10I				      PIC X(020).
	   02  TT11L				      PIC S9(4) COMP.
	   02  TT11F				      PIC X.
	   02  FILLER REDEFINES TT11F.
	       03  TT11A			      PIC X.
	   02  TT11I				      PIC X(020).
	   02  ST1L				      PIC S9(4) COMP.
	   02  ST1F				      PIC X.
	   02  FILLER REDEFINES ST1F.
	       03  ST1A 			      PIC X.
	   02  ST1I				      PIC X(010).
	   02  ST2L				      PIC S9(4) COMP.
	   02  ST2F				      PIC X.
	   02  FILLER REDEFINES ST2F.
	       03  ST2A 			      PIC X.
	   02  ST2I				      PIC X(010).
	   02  ST3L				      PIC S9(4) COMP.
	   02  ST3F				      PIC X.
	   02  FILLER REDEFINES ST3F.
	       03  ST3A 			      PIC X.
	   02  ST3I				      PIC X(010).
	   02  ST4L				      PIC S9(4) COMP.
	   02  ST4F				      PIC X.
	   02  FILLER REDEFINES ST4F.
	       03  ST4A 			      PIC X.
	   02  ST4I				      PIC X(010).
	   02  ST5L				      PIC S9(4) COMP.
	   02  ST5F				      PIC X.
	   02  FILLER REDEFINES ST5F.
	       03  ST5A 			      PIC X.
	   02  ST5I				      PIC X(010).
	   02  ST6L				      PIC S9(4) COMP.
	   02  ST6F				      PIC X.
	   02  FILLER REDEFINES ST6F.
	       03  ST6A 			      PIC X.
	   02  ST6I				      PIC X(010).
	   02  ST7L				      PIC S9(4) COMP.
	   02  ST7F				      PIC X.
	   02  FILLER REDEFINES ST7F.
	       03  ST7A 			      PIC X.
	   02  ST7I				      PIC X(010).
	   02  ST8L				      PIC S9(4) COMP.
	   02  ST8F				      PIC X.
	   02  FILLER REDEFINES ST8F.
	       03  ST8A 			      PIC X.
	   02  ST8I				      PIC X(010).
	   02  ST9L				      PIC S9(4) COMP.
	   02  ST9F				      PIC X.
	   02  FILLER REDEFINES ST9F.
	       03  ST9A 			      PIC X.
	   02  ST9I				      PIC X(010).
	   02  ST10L				      PIC S9(4) COMP.
	   02  ST10F				      PIC X.
	   02  FILLER REDEFINES ST10F.
	       03  ST10A			      PIC X.
	   02  ST10I				      PIC X(010).
	   02  ST11L				      PIC S9(4) COMP.
	   02  ST11F				      PIC X.
	   02  FILLER REDEFINES ST11F.
	       03  ST11A			      PIC X.
	   02  ST11I				      PIC X(010).
	   02  UD1L				      PIC S9(4) COMP.
	   02  UD1F				      PIC X.
	   02  FILLER REDEFINES UD1F.
	       03  UD1A 			      PIC X.
	   02  UD1I				      PIC X(008).
	   02  UD2L				      PIC S9(4) COMP.
	   02  UD2F				      PIC X.
	   02  FILLER REDEFINES UD2F.
	       03  UD2A 			      PIC X.
	   02  UD2I				      PIC X(008).
	   02  UD3L				      PIC S9(4) COMP.
	   02  UD3F				      PIC X.
	   02  FILLER REDEFINES UD3F.
	       03  UD3A 			      PIC X.
	   02  UD3I				      PIC X(008).
	   02  UD4L				      PIC S9(4) COMP.
	   02  UD4F				      PIC X.
	   02  FILLER REDEFINES UD4F.
	       03  UD4A 			      PIC X.
	   02  UD4I				      PIC X(008).
	   02  UD5L				      PIC S9(4) COMP.
	   02  UD5F				      PIC X.
	   02  FILLER REDEFINES UD5F.
	       03  UD5A 			      PIC X.
	   02  UD5I				      PIC X(008).
	   02  UD6L				      PIC S9(4) COMP.
	   02  UD6F				      PIC X.
	   02  FILLER REDEFINES UD6F.
	       03  UD6A 			      PIC X.
	   02  UD6I				      PIC X(008).
	   02  UD7L				      PIC S9(4) COMP.
	   02  UD7F				      PIC X.
	   02  FILLER REDEFINES UD7F.
	       03  UD7A 			      PIC X.
	   02  UD7I				      PIC X(008).
	   02  UD8L				      PIC S9(4) COMP.
	   02  UD8F				      PIC X.
	   02  FILLER REDEFINES UD8F.
	       03  UD8A 			      PIC X.
	   02  UD8I				      PIC X(008).
	   02  UD9L				      PIC S9(4) COMP.
	   02  UD9F				      PIC X.
	   02  FILLER REDEFINES UD9F.
	       03  UD9A 			      PIC X.
	   02  UD9I				      PIC X(008).
	   02  UD10L				      PIC S9(4) COMP.
	   02  UD10F				      PIC X.
	   02  FILLER REDEFINES UD10F.
	       03  UD10A			      PIC X.
	   02  UD10I				      PIC X(008).
	   02  UD11L				      PIC S9(4) COMP.
	   02  UD11F				      PIC X.
	   02  FILLER REDEFINES UD11F.
	       03  UD11A			      PIC X.
	   02  UD11I				      PIC X(008).
	   02  UB1L				      PIC S9(4) COMP.
	   02  UB1F				      PIC X.
	   02  FILLER REDEFINES UB1F.
	       03  UB1A 			      PIC X.
	   02  UB1I				      PIC X(007).
	   02  UB2L				      PIC S9(4) COMP.
	   02  UB2F				      PIC X.
	   02  FILLER REDEFINES UB2F.
	       03  UB2A 			      PIC X.
	   02  UB2I				      PIC X(007).
	   02  UB3L				      PIC S9(4) COMP.
	   02  UB3F				      PIC X.
	   02  FILLER REDEFINES UB3F.
	       03  UB3A 			      PIC X.
	   02  UB3I				      PIC X(007).
	   02  UB4L				      PIC S9(4) COMP.
	   02  UB4F				      PIC X.
	   02  FILLER REDEFINES UB4F.
	       03  UB4A 			      PIC X.
	   02  UB4I				      PIC X(007).
	   02  UB5L				      PIC S9(4) COMP.
	   02  UB5F				      PIC X.
	   02  FILLER REDEFINES UB5F.
	       03  UB5A 			      PIC X.
	   02  UB5I				      PIC X(007).
	   02  UB6L				      PIC S9(4) COMP.
	   02  UB6F				      PIC X.
	   02  FILLER REDEFINES UB6F.
	       03  UB6A 			      PIC X.
	   02  UB6I				      PIC X(007).
	   02  UB7L				      PIC S9(4) COMP.
	   02  UB7F				      PIC X.
	   02  FILLER REDEFINES UB7F.
	       03  UB7A 			      PIC X.
	   02  UB7I				      PIC X(007).
	   02  UB8L				      PIC S9(4) COMP.
	   02  UB8F				      PIC X.
	   02  FILLER REDEFINES UB8F.
	       03  UB8A 			      PIC X.
	   02  UB8I				      PIC X(007).
	   02  UB9L				      PIC S9(4) COMP.
	   02  UB9F				      PIC X.
	   02  FILLER REDEFINES UB9F.
	       03  UB9A 			      PIC X.
	   02  UB9I				      PIC X(007).
	   02  UB10L				      PIC S9(4) COMP.
	   02  UB10F				      PIC X.
	   02  FILLER REDEFINES UB10F.
	       03  UB10A			      PIC X.
	   02  UB10I				      PIC X(007).
	   02  UB11L				      PIC S9(4) COMP.
	   02  UB11F				      PIC X.
	   02  FILLER REDEFINES UB11F.
	       03  UB11A			      PIC X.
	   02  UB11I				      PIC X(007).
	   02  MSGL				      PIC S9(4) COMP.
	   02  MSGF				      PIC X.
	   02  FILLER REDEFINES MSGF.
	       03  MSGA 			      PIC X.
	   02  MSGI				      PIC X(060).
	   02  ADDL				      PIC S9(4) COMP.
	   02  ADDF				      PIC X.
	   02  FILLER REDEFINES ADDF.
	       03  ADDA 			      PIC X.
	   02  ADDI				      PIC X(009).
	   02  EXITL				      PIC S9(4) COMP.
	   02  EXITF				      PIC X.
	   02  FILLER REDEFINES EXITF.
	       03  EXITA			      PIC X.
	   02  EXITI				      PIC X(010).
	   02  FINDL				      PIC S9(4) COMP.
	   02  FINDF				      PIC X.
	   02  FILLER REDEFINES FINDF.
	       03  FINDA			      PIC X.
	   02  FINDI				      PIC X(010).
	   02  UPL				      PIC S9(4) COMP.
	   02  UPF				      PIC X.
	   02  FILLER REDEFINES UPF.
	       03  UPA				      PIC X.
	   02  UPI				      PIC X(008).
	   02  DOWNL				      PIC S9(4) COMP.
	   02  DOWNF				      PIC X.
	   02  FILLER REDEFINES DOWNF.
	       03  DOWNA			      PIC X.
	   02  DOWNI				      PIC X(010).
	   02  RESETL				      PIC S9(4) COMP.
	   02  RESETF				      PIC X.
	   02  FILLER REDEFINES RESETF.
	       03  RESETA			      PIC X.
	   02  RESETI				      PIC X(012).
       01  SM001MO REDEFINES SM001MI.
	   02  FILLER				      PIC X(12).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DATEO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  PAGEO				      PIC X(002).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TIMEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TITLEO				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  STATUSO				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TODATEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FRDATEO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC1O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC2O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC3O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC4O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC5O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC6O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC7O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC8O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC9O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC10O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UC11O				      PIC X(001).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN1O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN2O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN3O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN4O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN5O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN6O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN7O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN8O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN9O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN10O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TN11O				      PIC X(006).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT1O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT2O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT3O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT4O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT5O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT6O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT7O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT8O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT9O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT10O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  TT11O				      PIC X(020).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST1O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST2O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST3O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST4O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST5O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST6O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST7O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST8O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST9O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST10O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ST11O				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD1O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD2O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD3O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD4O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD5O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD6O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD7O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD8O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD9O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD10O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UD11O				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB1O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB2O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB3O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB4O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB5O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB6O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB7O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB8O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB9O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB10O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UB11O				      PIC X(007).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  MSGO				      PIC X(060).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  ADDO				      PIC X(009).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  EXITO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  FINDO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  UPO				      PIC X(008).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  DOWNO				      PIC X(010).
	   02  FILLER				      PIC XX.
	   02  FILLER				      PIC X.
	   02  RESETO				      PIC X(012).
